000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЖурналСобытий/ЖурналСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналСобытий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеПредставление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъектМетаданных</name>
    <comment>Имя ОбъектМетаданных</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Проверен</name>
    <comment>Воздействие проверено сторонним процессом.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>EnumRef.УровеньЖурналаРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ЭлементСтруктуры</name>
    <type>
      <types>CatalogRef.СтруктураУзлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>КодУзлаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЖурналСобытий/Forms/ФормаЗаписи/Module.bsl
&НаСервере	//	LNK 17.08.2020 12:31:15
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ФормаПроверитьКлючСерийногоНомера.Доступность = Ложь;

	Если Запись.Событие = "СЕРТИФИКАТЫ" И РольДоступна(Метаданные.Роли.АдминистраторСистемы) Тогда

		Элементы.ФормаПроверитьКлючСерийногоНомера.Доступность = НЕ ПустаяСтрока(ПолучитьКлючНомера(Запись.Комментарий));


	КонецЕсли;

КонецПроцедуры

&НаКлиенте	//	LNK 17.08.2020 12:34:12
Процедура ПроверитьКлючСерийногоНомера(Команда)

	КлючНомера = ПолучитьКлючНомера(Запись.Комментарий);

	Если НЕ ПустаяСтрока(КлючНомера) Тогда

		ПараметрыФормы = Новый Структура(
			"Заголовок, ТекстСообщения"
			, "Состав серийного номера"
			, ПроверитьДанныеСерийногоНомераНаСервере(КлючНомера)
		);

		ОткрытьФорму("ОбщаяФорма.ФормаПростогоТекстовогоСообщения"
			, ПараметрыФормы
			, ЭтотОбъект
			, ЭтотОбъект
			,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста	//	LNK 17.08.2020 12:34:12
Функция ПроверитьДанныеСерийногоНомераНаСервере(КлючНомера)

	УстановитьПривилегированныйРежим(Истина);

	ПредставлениеНомера = ОбщегоНазначенияКлиентСервер.СтруктураПредставление(
		"Состав ключа «" + КлючНомера + "»",
		ПодарочныеСертификатыСервер.ПолучитьСоставСерийногоНомера(КлючНомера)
	);

	Возврат ПредставлениеНомера;

КонецФункции

&НаКлиентеНаСервереБезКонтекста	//	LNK 17.08.2020 12:45:08
Функция ПолучитьКлючНомера(Комментарий)

	КлючНомера   = "";
	ПозицияФлага = Найти(Комментарий, "[ШК ");

	Если НЕ ПозицияФлага = 0 Тогда

		КлючНомера = СокрЛП(ОбщегоНазначенияКлиентСервер.lx_GetTooken(Сред(Комментарий, ПозицияФлага + 4), "]", 1));

	КонецЕсли;

	Возврат КлючНомера

КонецФункции

&НаКлиенте
Процедура КомандаПолучитьДанныеХранилища(Команда)

	ПараметрыФормы = Новый Структура("КлючЗаписи", Запись.ИсходныйКлючЗаписи);
	ОткрытьФорму("РегистрСведений.ЖурналСобытий.Форма.ФормаХранилищеТаблицNavision", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
